<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Chap5" data-toc-modified-id="Chap5-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Chap5</a></span><ul class="toc-item"><li><span><a href="#全部のColumnでどの値が何回出てるか調べる（HistGram的）" data-toc-modified-id="全部のColumnでどの値が何回出てるか調べる（HistGram的）-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>全部のColumnでどの値が何回出てるか調べる（HistGram的）</a></span></li></ul></li><li><span><a href="#Chap6" data-toc-modified-id="Chap6-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Chap6</a></span><ul class="toc-item"><li><span><a href="#mapの使い方" data-toc-modified-id="mapの使い方-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>mapの使い方</a></span></li><li><span><a href="#数字をカテゴリーに分ける（Cut）" data-toc-modified-id="数字をカテゴリーに分ける（Cut）-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>数字をカテゴリーに分ける（Cut）</a></span><ul class="toc-item"><li><span><a href="#18---25,-26---35,-36---60" data-toc-modified-id="18---25,-26---35,-36---60-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>18 - 25, 26 - 35, 36 - 60</a></span></li><li><span><a href="#name-categories" data-toc-modified-id="name-categories-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>name categories</a></span></li><li><span><a href="#勝手にBinに仕分ける方法" data-toc-modified-id="勝手にBinに仕分ける方法-2.2.3"><span class="toc-item-num">2.2.3&nbsp;&nbsp;</span>勝手にBinに仕分ける方法</a></span><ul class="toc-item"><li><span><a href="#Cutは適当にBinにいれる、QcutはBinを同じぐらいにしてくれる" data-toc-modified-id="Cutは適当にBinにいれる、QcutはBinを同じぐらいにしてくれる-2.2.3.1"><span class="toc-item-num">2.2.3.1&nbsp;&nbsp;</span>Cutは適当にBinにいれる、QcutはBinを同じぐらいにしてくれる</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Chap8" data-toc-modified-id="Chap8-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Chap8</a></span><ul class="toc-item"><li><span><a href="#Hierarchical-Index" data-toc-modified-id="Hierarchical-Index-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Hierarchical Index</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1.1"><span class="toc-item-num">3.1.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#DataFrame" data-toc-modified-id="DataFrame-3.1.2"><span class="toc-item-num">3.1.2&nbsp;&nbsp;</span>DataFrame</a></span><ul class="toc-item"><li><span><a href="#Index,-Columnの階層ごとに名前をつける" data-toc-modified-id="Index,-Columnの階層ごとに名前をつける-3.1.2.1"><span class="toc-item-num">3.1.2.1&nbsp;&nbsp;</span>Index, Columnの階層ごとに名前をつける</a></span></li><li><span><a href="#SwapLeve" data-toc-modified-id="SwapLeve-3.1.2.2"><span class="toc-item-num">3.1.2.2&nbsp;&nbsp;</span>SwapLeve</a></span></li></ul></li></ul></li><li><span><a href="#Reshape" data-toc-modified-id="Reshape-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Reshape</a></span><ul class="toc-item"><li><span><a href="#Stack-and-Unstack" data-toc-modified-id="Stack-and-Unstack-3.2.1"><span class="toc-item-num">3.2.1&nbsp;&nbsp;</span>Stack and Unstack</a></span><ul class="toc-item"><li><span><a href="#axisにごとにunstackできる" data-toc-modified-id="axisにごとにunstackできる-3.2.1.1"><span class="toc-item-num">3.2.1.1&nbsp;&nbsp;</span>axisにごとにunstackできる</a></span></li></ul></li><li><span><a href="#PIVOT" data-toc-modified-id="PIVOT-3.2.2"><span class="toc-item-num">3.2.2&nbsp;&nbsp;</span><a href="https://pandas.pydata.org/pandas-docs/stable/reshaping.html" target="_blank">PIVOT</a></a></span></li><li><span><a href="#Melt" data-toc-modified-id="Melt-3.2.3"><span class="toc-item-num">3.2.3&nbsp;&nbsp;</span>Melt</a></span></li></ul></li></ul></li><li><span><a href="#Chap-10" data-toc-modified-id="Chap-10-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Chap 10</a></span><ul class="toc-item"><li><span><a href="#groupbyの使い方" data-toc-modified-id="groupbyの使い方-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>groupbyの使い方</a></span><ul class="toc-item"><li><span><a href="#DictでGroup" data-toc-modified-id="DictでGroup-4.1.1"><span class="toc-item-num">4.1.1&nbsp;&nbsp;</span>DictでGroup</a></span></li><li><span><a href="#Dictの代わりにFunctionsつかってもいい" data-toc-modified-id="Dictの代わりにFunctionsつかってもいい-4.1.2"><span class="toc-item-num">4.1.2&nbsp;&nbsp;</span>Dictの代わりにFunctionsつかってもいい</a></span></li><li><span><a href="#MultindexをGroupする" data-toc-modified-id="MultindexをGroupする-4.1.3"><span class="toc-item-num">4.1.3&nbsp;&nbsp;</span>MultindexをGroupする</a></span></li><li><span><a href="#Groupby-AGG:-tuple-と-Dict-の違い" data-toc-modified-id="Groupby-AGG:-tuple-と-Dict-の違い-4.1.4"><span class="toc-item-num">4.1.4&nbsp;&nbsp;</span>Groupby AGG: tuple と Dict の違い</a></span></li><li><span><a href="#Aggregation" data-toc-modified-id="Aggregation-4.1.5"><span class="toc-item-num">4.1.5&nbsp;&nbsp;</span>Aggregation</a></span><ul class="toc-item"><li><span><a href="#普通の集計" data-toc-modified-id="普通の集計-4.1.5.1"><span class="toc-item-num">4.1.5.1&nbsp;&nbsp;</span>普通の集計</a></span></li><li><span><a href="#計算方法に名前をつけるときはTuple" data-toc-modified-id="計算方法に名前をつけるときはTuple-4.1.5.2"><span class="toc-item-num">4.1.5.2&nbsp;&nbsp;</span>計算方法に名前をつけるときはTuple</a></span></li><li><span><a href="#カラムごとに別の計算式を使いたいはDict" data-toc-modified-id="カラムごとに別の計算式を使いたいはDict-4.1.5.3"><span class="toc-item-num">4.1.5.3&nbsp;&nbsp;</span>カラムごとに別の計算式を使いたいはDict</a></span></li></ul></li><li><span><a href="#インデックスをなくして計算する" data-toc-modified-id="インデックスをなくして計算する-4.1.6"><span class="toc-item-num">4.1.6&nbsp;&nbsp;</span>インデックスをなくして計算する</a></span></li></ul></li><li><span><a href="#Apply" data-toc-modified-id="Apply-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Apply</a></span><ul class="toc-item"><li><span><a href="#Applyを使って、その日の最高額Top3を出す" data-toc-modified-id="Applyを使って、その日の最高額Top3を出す-4.2.1"><span class="toc-item-num">4.2.1&nbsp;&nbsp;</span>Applyを使って、その日の最高額Top3を出す</a></span></li><li><span><a href="#Applyを使う" data-toc-modified-id="Applyを使う-4.2.2"><span class="toc-item-num">4.2.2&nbsp;&nbsp;</span>Applyを使う</a></span></li><li><span><a href="#引数も渡せる" data-toc-modified-id="引数も渡せる-4.2.3"><span class="toc-item-num">4.2.3&nbsp;&nbsp;</span>引数も渡せる</a></span></li><li><span><a href="#group_keys=Falseで階層をなくせる" data-toc-modified-id="group_keys=Falseで階層をなくせる-4.2.4"><span class="toc-item-num">4.2.4&nbsp;&nbsp;</span>group_keys=Falseで階層をなくせる</a></span></li><li><span><a href="#Bucket-Analysis" data-toc-modified-id="Bucket-Analysis-4.2.5"><span class="toc-item-num">4.2.5&nbsp;&nbsp;</span>Bucket Analysis</a></span><ul class="toc-item"><li><span><a href="#Bucketを作る" data-toc-modified-id="Bucketを作る-4.2.5.1"><span class="toc-item-num">4.2.5.1&nbsp;&nbsp;</span>Bucketを作る</a></span></li><li><span><a href="#それぞれの範囲で、最大最小などを計測" data-toc-modified-id="それぞれの範囲で、最大最小などを計測-4.2.5.2"><span class="toc-item-num">4.2.5.2&nbsp;&nbsp;</span>それぞれの範囲で、最大最小などを計測</a></span></li></ul></li></ul></li><li><span><a href="#株価の相関を求める" data-toc-modified-id="株価の相関を求める-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>株価の相関を求める</a></span><ul class="toc-item"><li><span><a href="#変化率を出す" data-toc-modified-id="変化率を出す-4.3.1"><span class="toc-item-num">4.3.1&nbsp;&nbsp;</span>変化率を出す</a></span></li><li><span><a href="#年ごとにGroupして、相関を出す" data-toc-modified-id="年ごとにGroupして、相関を出す-4.3.2"><span class="toc-item-num">4.3.2&nbsp;&nbsp;</span>年ごとにGroupして、相関を出す</a></span></li><li><span><a href="#ほかのColumn同士の関係も見る" data-toc-modified-id="ほかのColumn同士の関係も見る-4.3.3"><span class="toc-item-num">4.3.3&nbsp;&nbsp;</span>ほかのColumn同士の関係も見る</a></span></li></ul></li><li><span><a href="#回帰分析する" data-toc-modified-id="回帰分析する-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>回帰分析する</a></span></li><li><span><a href="#Pivot-Table" data-toc-modified-id="Pivot-Table-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Pivot Table</a></span><ul class="toc-item"><li><span><a href="#2つのColumnをインデックスにしてまとめる" data-toc-modified-id="2つのColumnをインデックスにしてまとめる-4.5.1"><span class="toc-item-num">4.5.1&nbsp;&nbsp;</span>2つのColumnをインデックスにしてまとめる</a></span></li><li><span><a href="#2つのColumnをインデックスにして、1つのColumnをColIndexにする" data-toc-modified-id="2つのColumnをインデックスにして、1つのColumnをColIndexにする-4.5.2"><span class="toc-item-num">4.5.2&nbsp;&nbsp;</span>2つのColumnをインデックスにして、1つのColumnをColIndexにする</a></span></li><li><span><a href="#AggFuncとかFillValueをつかう" data-toc-modified-id="AggFuncとかFillValueをつかう-4.5.3"><span class="toc-item-num">4.5.3&nbsp;&nbsp;</span>AggFuncとかFillValueをつかう</a></span></li></ul></li><li><span><a href="#CrossTabでクロス集計する" data-toc-modified-id="CrossTabでクロス集計する-4.6"><span class="toc-item-num">4.6&nbsp;&nbsp;</span>CrossTabでクロス集計する</a></span><ul class="toc-item"><li><span><a href="#Smokerのクロス集計" data-toc-modified-id="Smokerのクロス集計-4.6.1"><span class="toc-item-num">4.6.1&nbsp;&nbsp;</span>Smokerのクロス集計</a></span></li></ul></li></ul></li><li><span><a href="#Chap11" data-toc-modified-id="Chap11-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Chap11</a></span></li></ul></div>

# Chap5

## 全部のColumnでどの値が何回出てるか調べる（HistGram的）

In [1]:
import pandas as pd

df = pd.DataFrame(
    {
        'a': [1,2,3,4,5],
        'b': [2,4,6,8,10],
        'c': [1, 3, 6, 9, 12],
    }
)

df.apply(pd.value_counts)

      a    b    c
1   1.0  NaN  1.0
2   1.0  1.0  NaN
3   1.0  NaN  1.0
4   1.0  1.0  NaN
5   1.0  NaN  NaN
6   NaN  1.0  1.0
8   NaN  1.0  NaN
9   NaN  NaN  1.0
10  NaN  1.0  NaN
12  NaN  NaN  1.0

In [2]:
df.apply(pd.value_counts).fillna(0)

      a    b    c
1   1.0  0.0  1.0
2   1.0  1.0  0.0
3   1.0  0.0  1.0
4   1.0  1.0  0.0
5   1.0  0.0  0.0
6   0.0  1.0  1.0
8   0.0  1.0  0.0
9   0.0  0.0  1.0
10  0.0  1.0  0.0
12  0.0  0.0  1.0

# Chap6

## mapの使い方

In [3]:
import pandas as pd

def test(x):
    return x

df = pd.DataFrame({
    'value': range(21),
})

df['value'].map(test)

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
Name: value, dtype: int64

In [4]:
import pandas as pd

def test(x):
    if x % 3 == 0:
        return 'fiz'
    elif x % 2 == 0:
        return 'buz'
    else:
        return 'fizbuz'

df = pd.DataFrame({
    'value': range(21),
})

df['value'].map(test)

0        fiz
1     fizbuz
2        buz
3        fiz
4        buz
5     fizbuz
6        fiz
7     fizbuz
8        buz
9        fiz
10       buz
11    fizbuz
12       fiz
13    fizbuz
14       buz
15       fiz
16       buz
17    fizbuz
18       fiz
19    fizbuz
20       buz
Name: value, dtype: object

## 数字をカテゴリーに分ける（Cut）

### 18 - 25, 26 - 35, 36 - 60

In [5]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 41, 32]
bins = [18, 25, 35, 60, 100]

cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (35, 60], (25, 35], (60, 100], (35, 60], (25, 35]]
Length: 11
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [6]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 1], dtype=int8)

In [7]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [8]:
cats.categories[1]

Interval(25, 35, closed='right')

In [9]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     2
(60, 100]    1
dtype: int64

### name categories

In [10]:
group_names  = ['youth', 'young-adult', 'middle-aged', 'senior']

pd.cut(ages, bins, labels=group_names)

[youth, youth, youth, young-adult, youth, ..., middle-aged, young-adult, senior, middle-aged, young-adult]
Length: 11
Categories (4, object): [youth < young-adult < middle-aged < senior]

### 勝手にBinに仕分ける方法

In [11]:
# 4つのBin
data = range(20)
cate = pd.cut(data, 4, precision=2)
pd.value_counts(cate)

(14.25, 19.0]     5
(9.5, 14.25]      5
(4.75, 9.5]       5
(-0.019, 4.75]    5
dtype: int64

In [12]:
# 2つのBin
data = range(13)
cate = pd.cut(data, 2, precision=2)
pd.value_counts(cate)

(-0.012, 6.0]    7
(6.0, 12.0]      6
dtype: int64

#### Cutは適当にBinにいれる、QcutはBinを同じぐらいにしてくれる

In [13]:
# qcutだとRandomNumでもBinのサイズを同じぐらいにしてくれる
import numpy as np
data = np.random.randn(1000)
cate = pd.qcut(data, 4)
pd.value_counts(cate)

(0.704, 4.097]                   250
(-0.0151, 0.704]                 250
(-0.736, -0.0151]                250
(-3.8819999999999997, -0.736]    250
dtype: int64

In [14]:
# cut だと都合よくいかない
import numpy as np
data = np.random.randn(1000)
cate = pd.cut(data, 4)
pd.value_counts(cate)

(-1.899, -0.0966]    469
(-0.0966, 1.706]     464
(1.706, 3.509]        35
(-3.709, -1.899]      32
dtype: int64

# Chap8

## Hierarchical Index

### Series

In [15]:
import pandas as pd
import numpy as np
ds = pd.Series(np.random.randn(9),
          index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                 [1,2,3,1,3,1,2,2,3]])
ds

a  1   -1.396827
   2   -0.135486
   3    1.279954
b  1    0.741166
   3    0.410166
c  1   -0.833514
   2   -0.866706
d  2   -1.561189
   3    1.390293
dtype: float64

In [16]:
ds.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [17]:
ds['b']

1    0.741166
3    0.410166
dtype: float64

In [18]:
ds['b':'c']

b  1    0.741166
   3    0.410166
c  1   -0.833514
   2   -0.866706
dtype: float64

In [19]:
ds[['b', 'd']]

b  1    0.741166
   3    0.410166
d  2   -1.561189
   3    1.390293
dtype: float64

In [20]:
ds.loc[['b', 'd']]

b  1    0.741166
   3    0.410166
d  2   -1.561189
   3    1.390293
dtype: float64

In [21]:
ds.unstack()

          1         2         3
a -1.396827 -0.135486  1.279954
b  0.741166       NaN  0.410166
c -0.833514 -0.866706       NaN
d       NaN -1.561189  1.390293

In [22]:
ds.unstack().stack()

a  1   -1.396827
   2   -0.135486
   3    1.279954
b  1    0.741166
   3    0.410166
c  1   -0.833514
   2   -0.866706
d  2   -1.561189
   3    1.390293
dtype: float64

### DataFrame

In [23]:
import pandas as pd
import numpy as np
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

#### Index, Columnの階層ごとに名前をつける

In [24]:
frame.index.names = ['key1', 'key2'] # インデックスの階層ごとに名前をつける
frame.columns.names = ['state', 'color'] # Columnの階層ごとに名前をつける

In [25]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

#### SwapLeve

In [26]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

###### MultiLevelIndexでソートする

In [27]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [28]:
frame.sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

## Reshape

### Stack and Unstack

- stack
  - This “rotates” or pivots from the columns in the data to the rows
- unstack
  - This pivots from the rows into the columns

In [29]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'],
                                     name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [30]:
res = data.stack()
res

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [31]:
res.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

#### axisにごとにunstackできる

In [32]:
res.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [33]:
res.unstack(1)

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [34]:
res.unstack('state') # index や Columnの名前でも良い

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

### [PIVOT](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)

In [35]:
import pandas.util.testing as tm; tm.N = 3
def unpivot(frame):
    N, K = frame.shape
    data = {'value' : frame.values.ravel('F'),
            'variable' : np.asarray(frame.columns).repeat(N),
            'date' : np.tile(np.asarray(frame.index), K)}
    return pd.DataFrame(data, columns=['date', 'variable', 'value'])
df = unpivot(tm.makeTimeDataFrame())
df

         date variable     value
0  2000-01-03        A -2.047743
1  2000-01-04        A  0.852758
2  2000-01-05        A  1.441098
3  2000-01-03        B  0.273903
4  2000-01-04        B  0.952052
5  2000-01-05        B  1.075215
6  2000-01-03        C  0.527871
7  2000-01-04        C  0.733499
8  2000-01-05        C -0.337099
9  2000-01-03        D -0.537837
10 2000-01-04        D  0.224775
11 2000-01-05        D -1.392276

In [36]:
df.pivot(index='date', columns='variable', values='value')

variable           A         B         C         D
date
2000-01-03 -2.047743  0.273903  0.527871 -0.537837
2000-01-04  0.852758  0.952052  0.733499  0.224775
2000-01-05  1.441098  1.075215 -0.337099 -1.392276

In [37]:
df.pivot(index='variable', columns='date', values='value')

date      2000-01-03  2000-01-04  2000-01-05
variable
A          -2.047743    0.852758    1.441098
B           0.273903    0.952052    1.075215
C           0.527871    0.733499   -0.337099
D          -0.537837    0.224775   -1.392276

In [38]:
df.pivot(index='value', columns='date', values='variable')

date      2000-01-03 2000-01-04 2000-01-05
value
-2.047743          A       None       None
-1.392276       None       None          D
-0.537837          D       None       None
-0.337099       None       None          C
 0.224775       None          D       None
 0.273903          B       None       None
 0.527871          C       None       None
 0.733499       None          C       None
 0.852758       None          A       None
 0.952052       None          B       None
 1.075215       None       None          B
 1.441098       None       None          A

### Melt

pivot => Transform one column into many   
melt => merges multiple column into one

In [39]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                   'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})
df

   A  B  C  key
0  1  4  7  foo
1  2  5  8  bar
2  3  6  9  baz

In [40]:
df2 = pd.melt(df, ['key']).sort_values(by='key', ascending=False)
df2

   key variable  value
0  foo        A      1
3  foo        B      4
6  foo        C      7
2  baz        A      3
5  baz        B      6
8  baz        C      9
1  bar        A      2
4  bar        B      5
7  bar        C      8

In [41]:
df3 = pd.melt(df, ['A'])
df3

   A variable value
0  1        B     4
1  2        B     5
2  3        B     6
3  1        C     7
4  2        C     8
5  3        C     9
6  1      key   foo
7  2      key   bar
8  3      key   baz

In [42]:
df2.pivot('key', 'variable', 'value') # Meltされたものに、Pivotするともとにもどる

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

# Chap 10

## groupbyの使い方

In [43]:
import pandas as pd
import numpy as np
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

people

               a         b         c         d         e
Joe     0.184800  0.378950  0.973492  1.004968 -0.393641
Steve  -0.290826  0.557856  1.957497  0.341276  2.253639
Wes     1.236797  0.549326 -1.254996 -1.215574 -1.608255
Jim    -0.025729  1.086981 -1.290657  0.042914  0.477079
Travis  0.347499 -0.516446  0.136970  0.562259  1.581974

### DictでGroup

In [44]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f' : 'orange'}
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe     1.978460  0.170109
Steve   2.298773  2.520669
Wes    -2.470570  0.177868
Jim    -1.247744  1.538330
Travis  0.699229  1.413028

### Dictの代わりにFunctionsつかってもいい

In [45]:
def test(x):
    return f"name length is: {len(x)}"

people.groupby(test).sum()

                          a         b         c         d         e
name length is: 3  1.395868  2.015257 -1.572162 -0.167691 -1.524817
name length is: 5 -0.290826  0.557856  1.957497  0.341276  2.253639
name length is: 6  0.347499 -0.516446  0.136970  0.562259  1.581974

### MultindexをGroupする

In [46]:
import pandas as pd
import numpy as np

people = pd.DataFrame(np.random.randn(5, 5),
                      columns=[['US', 'JP', 'JP', 'US', 'US'],
                               ['a', 'b', 'c', 'd', 'e']],
                      index=[['NY', 'NY', 'CA', 'CA', 'WA'],
                             ['Joe', 'Steve', 'Wes', 'Jim', 'Travis']])
people

                 US        JP                  US
                  a         b         c         d         e
NY Joe     0.049559  2.103018  1.242022  0.115664 -0.681024
   Steve  -0.842277 -1.337474 -0.877963 -1.216735 -0.814068
CA Wes    -0.828131  0.644926  1.341146 -1.797815  1.109326
   Jim     0.233674 -0.852783  0.229151  0.393502 -0.285835
WA Travis  1.401944  0.613131 -0.809081 -0.350232  0.445671

In [47]:
people.groupby(level=0, axis=1).count()

           JP  US
NY Joe      2   3
   Steve    2   3
CA Wes      2   3
   Jim      2   3
WA Travis   2   3

In [48]:
people.groupby(level=0, axis=0).count()

   US JP    US
    a  b  c  d  e
CA  2  2  2  2  2
NY  2  2  2  2  2
WA  1  1  1  1  1

### Groupby AGG: tuple と Dict の違い

In [49]:
import pandas as pd
df = pd.read_csv('tips.csv')
df.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

In [50]:
grouped = df.groupby(['day', 'smoker'])
grouped.count().head()

            total_bill  tip  time  size
day smoker
Fri No               4    4     4     4
    Yes             15   15    15    15
Sat No              45   45    45    45
    Yes             42   42    42    42
Sun No              57   57    57    57

### Aggregation

#### 普通の集計

In [51]:
grouped.agg(['sum', 'mean'])

            total_bill                tip           size
                   sum       mean     sum      mean  sum      mean
day  smoker
Fri  No          73.68  18.420000   11.25  2.812500    9  2.250000
     Yes        252.20  16.813333   40.71  2.714000   31  2.066667
Sat  No         884.78  19.661778  139.63  3.102889  115  2.555556
     Yes        893.62  21.276667  120.77  2.875476  104  2.476190
Sun  No        1168.88  20.506667  180.57  3.167895  167  2.929825
     Yes        458.28  24.120000   66.82  3.516842   49  2.578947
Thur No         770.09  17.113111  120.32  2.673778  112  2.488889
     Yes        326.24  19.190588   51.51  3.030000   40  2.352941

#### 計算方法に名前をつけるときはTuple

In [52]:
grouped.agg([('合計', 'sum'), ('平均', 'mean')])

            total_bill                tip           size
                    合計         平均      合計        平均   合計        平均
day  smoker
Fri  No          73.68  18.420000   11.25  2.812500    9  2.250000
     Yes        252.20  16.813333   40.71  2.714000   31  2.066667
Sat  No         884.78  19.661778  139.63  3.102889  115  2.555556
     Yes        893.62  21.276667  120.77  2.875476  104  2.476190
Sun  No        1168.88  20.506667  180.57  3.167895  167  2.929825
     Yes        458.28  24.120000   66.82  3.516842   49  2.578947
Thur No         770.09  17.113111  120.32  2.673778  112  2.488889
     Yes        326.24  19.190588   51.51  3.030000   40  2.352941

#### カラムごとに別の計算式を使いたいはDict

In [53]:
grouped.agg({'total_bill': 'sum', 'tip': 'mean'})

             total_bill       tip
day  smoker
Fri  No           73.68  2.812500
     Yes         252.20  2.714000
Sat  No          884.78  3.102889
     Yes         893.62  2.875476
Sun  No         1168.88  3.167895
     Yes         458.28  3.516842
Thur No          770.09  2.673778
     Yes         326.24  3.030000

In [54]:
grouped.agg({'total_bill': [('合計', 'sum'), ('平均', 'mean')],
             'tip': [('平均', 'mean'), ('偏差', 'std')]})

            total_bill                  tip
                    合計         平均        平均        偏差
day  smoker
Fri  No          73.68  18.420000  2.812500  0.898494
     Yes        252.20  16.813333  2.714000  1.077668
Sat  No         884.78  19.661778  3.102889  1.642088
     Yes        893.62  21.276667  2.875476  1.630580
Sun  No        1168.88  20.506667  3.167895  1.224785
     Yes        458.28  24.120000  3.516842  1.261151
Thur No         770.09  17.113111  2.673778  1.282964
     Yes        326.24  19.190588  3.030000  1.113491

### インデックスをなくして計算する

In [55]:
df.groupby(['day', 'smoker']).mean()

             total_bill       tip      size
day  smoker
Fri  No       18.420000  2.812500  2.250000
     Yes      16.813333  2.714000  2.066667
Sat  No       19.661778  3.102889  2.555556
     Yes      21.276667  2.875476  2.476190
Sun  No       20.506667  3.167895  2.929825
     Yes      24.120000  3.516842  2.578947
Thur No       17.113111  2.673778  2.488889
     Yes      19.190588  3.030000  2.352941

In [56]:
df.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size
0   Fri     No   18.420000  2.812500  2.250000
1   Fri    Yes   16.813333  2.714000  2.066667
2   Sat     No   19.661778  3.102889  2.555556
3   Sat    Yes   21.276667  2.875476  2.476190
4   Sun     No   20.506667  3.167895  2.929825
5   Sun    Yes   24.120000  3.516842  2.578947
6  Thur     No   17.113111  2.673778  2.488889
7  Thur    Yes   19.190588  3.030000  2.352941

In [57]:
df2 = df.groupby(['day', 'smoker'], as_index=False)
df2.agg({'total_bill': [('合計', 'sum'), ('平均', 'mean')],
         'tip': [('平均', 'mean'), ('偏差', 'std')]})

    day smoker total_bill                  tip
                       合計         平均        平均        偏差
0   Fri     No      73.68  18.420000  2.812500  0.898494
1   Fri    Yes     252.20  16.813333  2.714000  1.077668
2   Sat     No     884.78  19.661778  3.102889  1.642088
3   Sat    Yes     893.62  21.276667  2.875476  1.630580
4   Sun     No    1168.88  20.506667  3.167895  1.224785
5   Sun    Yes     458.28  24.120000  3.516842  1.261151
6  Thur     No     770.09  17.113111  2.673778  1.282964
7  Thur    Yes     326.24  19.190588  3.030000  1.113491

## Apply

### Applyを使って、その日の最高額Top3を出す

In [58]:
import pandas as pd
df = pd.read_csv('tips.csv')
df.groupby(['day', 'time']).count()

             total_bill  tip  smoker  size
day  time
Fri  Dinner          12   12      12    12
     Lunch            7    7       7     7
Sat  Dinner          87   87      87    87
Sun  Dinner          76   76      76    76
Thur Dinner           1    1       1     1
     Lunch           61   61      61    61

### Applyを使う

In [59]:
def top(x, n=3, column='tip'):
    return x.sort_values(by=column, ascending=False)[-n:]

df2 = df.groupby(['day', 'time'])
df2.apply(top)

                 total_bill   tip smoker   day    time  size
day  time
Fri  Dinner 97        12.03  1.50    Yes   Fri  Dinner     2
            99        12.46  1.50     No   Fri  Dinner     2
            92         5.75  1.00    Yes   Fri  Dinner     2
     Lunch  226       10.09  2.00    Yes   Fri   Lunch     2
            222        8.58  1.92    Yes   Fri   Lunch     1
            224       13.42  1.58    Yes   Fri   Lunch     2
Sat  Dinner 236       12.60  1.00    Yes   Sat  Dinner     2
            67         3.07  1.00    Yes   Sat  Dinner     1
            111        7.25  1.00     No   Sat  Dinner     1
Sun  Dinner 190       15.69  1.50    Yes   Sun  Dinner     2
            43         9.68  1.32     No   Sun  Dinner     2
            0         16.99  1.01     No   Sun  Dinner     2
Thur Dinner 243       18.78  3.00     No  Thur  Dinner     2
     Lunch  195        7.56  1.44     No  Thur   Lunch     2
            146       18.64  1.36     No  Thur   Lunch     3
            135        8.51  1.25     No  Thur   Lunch     2

### 引数も渡せる

In [60]:
df2.apply(top, n=2, column='total_bill')

                 total_bill   tip smoker   day    time  size
day  time
Fri  Dinner 100       11.35  2.50    Yes   Fri  Dinner     2
            92         5.75  1.00    Yes   Fri  Dinner     2
     Lunch  226       10.09  2.00    Yes   Fri   Lunch     2
            222        8.58  1.92    Yes   Fri   Lunch     1
Sat  Dinner 111        7.25  1.00     No   Sat  Dinner     1
            67         3.07  1.00    Yes   Sat  Dinner     1
Sun  Dinner 6          8.77  2.00     No   Sun  Dinner     2
            172        7.25  5.15    Yes   Sun  Dinner     2
Thur Dinner 243       18.78  3.00     No  Thur  Dinner     2
     Lunch  195        7.56  1.44     No  Thur   Lunch     2
            149        7.51  2.00     No  Thur   Lunch     2

### group_keys=Falseで階層をなくせる

In [61]:
df.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size
smoker
No     135        8.51  1.25     No  Thur   Lunch     2
       0         16.99  1.01     No   Sun  Dinner     2
       111        7.25  1.00     No   Sat  Dinner     1
Yes    67         3.07  1.00    Yes   Sat  Dinner     1
       236       12.60  1.00    Yes   Sat  Dinner     2
       92         5.75  1.00    Yes   Fri  Dinner     2

In [62]:
df.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size
135        8.51  1.25     No  Thur   Lunch     2
0         16.99  1.01     No   Sun  Dinner     2
111        7.25  1.00     No   Sat  Dinner     1
67         3.07  1.00    Yes   Sat  Dinner     1
236       12.60  1.00    Yes   Sat  Dinner     2
92         5.75  1.00    Yes   Fri  Dinner     2

### Bucket Analysis

#### Bucketを作る

In [63]:
import pandas as pd
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})

frame.head()

      data1     data2
0  0.646062 -0.928439
1 -0.396921  0.194479
2 -0.757042 -0.056250
3  0.363097 -0.516470
4  1.290915 -0.196657

##### 四個ずつの範囲にカットする

In [64]:
quartiles = pd.cut(frame.data1, 4)
quartiles[:10]

0     (-0.242, 1.479]
1    (-1.964, -0.242]
2    (-1.964, -0.242]
3     (-0.242, 1.479]
4     (-0.242, 1.479]
5     (-0.242, 1.479]
6     (-0.242, 1.479]
7    (-1.964, -0.242]
8     (-0.242, 1.479]
9      (1.479, 3.201]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.692, -1.964] < (-1.964, -0.242] < (-0.242, 1.479] < (1.479, 3.201]]

#### それぞれの範囲で、最大最小などを計測

In [65]:
def get_stats(group):
    return {'min': group.min(),
            'max': group.max(),
            'count': group.count(),
            'mean': group.mean()}

grouped = frame.data2.groupby(quartiles)
grouped.apply(get_stats)

data1
(-3.692, -1.964]  count     25.000000
                  max        1.873543
                  mean      -0.088505
                  min       -1.755545
(-1.964, -0.242]  count    400.000000
                  max        2.959608
                  mean      -0.034495
                  min       -2.509346
(-0.242, 1.479]   count    510.000000
                  max        2.798103
                  mean       0.006807
                  min       -2.760613
(1.479, 3.201]    count     65.000000
                  max        2.781304
                  mean      -0.205990
                  min       -2.318283
Name: data2, dtype: float64

In [66]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.692, -1.964]   25.0  1.873543 -0.088505 -1.755545
(-1.964, -0.242]  400.0  2.959608 -0.034495 -2.509346
(-0.242, 1.479]   510.0  2.798103  0.006807 -2.760613
(1.479, 3.201]     65.0  2.781304 -0.205990 -2.318283

## 株価の相関を求める

In [67]:
import pandas as pd
prices = pd.read_csv('stock_px_2.csv', parse_dates=True, index_col=0)
prices.head()

            AAPL   MSFT    XOM     SPX
2003-01-02  7.40  21.11  29.22  909.03
2003-01-03  7.45  21.14  29.24  908.59
2003-01-06  7.45  21.52  29.96  929.01
2003-01-07  7.43  21.93  28.95  922.93
2003-01-08  7.28  21.31  28.83  909.93

### 変化率を出す

In [68]:
rets = prices.pct_change().dropna()
rets.head()

                AAPL      MSFT       XOM       SPX
2003-01-03  0.006757  0.001421  0.000684 -0.000484
2003-01-06  0.000000  0.017975  0.024624  0.022474
2003-01-07 -0.002685  0.019052 -0.033712 -0.006545
2003-01-08 -0.020188 -0.028272 -0.004145 -0.014086
2003-01-09  0.008242  0.029094  0.021159  0.019386

### 年ごとにGroupして、相関を出す

In [69]:
spx_corr = lambda x: x.corrwith(x['SPX'])
get_year = lambda x: x.year
by_year = rets.groupby(get_year)
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

### ほかのColumn同士の関係も見る

In [70]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

## 回帰分析する

In [71]:
import statsmodels.api as sm
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

by_year.apply(regress, 'AAPL', ['SPX'])

/home/orz/anaconda3/lib/python3.6/site-packages/statsmodels/compat/pandas.py:56: FutureWarning: The pandas.core.datetools module is deprecated and will be removed in a future version. Please use the pandas.tseries module instead.
  from pandas.core import datetools

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

## Pivot Table

In [72]:
import pandas as pd

tips = pd.read_csv('tips.csv')
tips.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

### 2つのColumnをインデックスにしてまとめる

In [73]:
tips.pivot_table(index=['day', 'smoker'])
# pd.pivot_table(tips, index=['day', 'smoker']) もおなじ

                 size       tip  total_bill
day  smoker
Fri  No      2.250000  2.812500   18.420000
     Yes     2.066667  2.714000   16.813333
Sat  No      2.555556  3.102889   19.661778
     Yes     2.476190  2.875476   21.276667
Sun  No      2.929825  3.167895   20.506667
     Yes     2.578947  3.516842   24.120000
Thur No      2.488889  2.673778   17.113111
     Yes     2.352941  3.030000   19.190588

### 2つのColumnをインデックスにして、1つのColumnをColIndexにする

In [74]:
tips.pivot_table(columns=['smoker'], index=['time', 'day'])

                 size                 tip           total_bill
smoker             No       Yes        No       Yes         No        Yes
time   day
Dinner Fri   2.000000  2.222222  2.750000  3.003333  19.233333  19.806667
       Sat   2.555556  2.476190  3.102889  2.875476  19.661778  21.276667
       Sun   2.929825  2.578947  3.167895  3.516842  20.506667  24.120000
       Thur  2.000000       NaN  3.000000       NaN  18.780000        NaN
Lunch  Fri   3.000000  1.833333  3.000000  2.280000  15.980000  12.323333
       Thur  2.500000  2.352941  2.666364  3.030000  17.075227  19.190588

In [75]:
tips.pivot_table(['size', 'tip'], columns=['smoker'], index=['time', 'day'], margins=True)

                 size                           tip
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  2.750000  3.003333  2.940000
       Sat   2.555556  2.476190  2.517241  3.102889  2.875476  2.993103
       Sun   2.929825  2.578947  2.842105  3.167895  3.516842  3.255132
       Thur  2.000000       NaN  2.000000  3.000000       NaN  3.000000
Lunch  Fri   3.000000  1.833333  2.000000  3.000000  2.280000  2.382857
       Thur  2.500000  2.352941  2.459016  2.666364  3.030000  2.767705
All          2.668874  2.408602  2.569672  2.991854  3.008710  2.998279

In [76]:
pd.pivot_table(tips, ['size', 'tip'], columns=['smoker'], index=['time', 'day'], margins=False)

                 size                 tip
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  2.750000  3.003333
       Sat   2.555556  2.476190  3.102889  2.875476
       Sun   2.929825  2.578947  3.167895  3.516842
       Thur  2.000000       NaN  3.000000       NaN
Lunch  Fri   3.000000  1.833333  3.000000  2.280000
       Thur  2.500000  2.352941  2.666364  3.030000

### AggFuncとかFillValueをつかう

In [77]:
pd.pivot_table(tips,
               ['size', 'tip'],
               columns=['smoker'],
               index=['time', 'day'],
               margins=False,
               aggfunc='count',
               fill_value=0)

            size     tip
smoker        No Yes  No Yes
time   day
Dinner Fri     3   9   3   9
       Sat    45  42  45  42
       Sun    57  19  57  19
       Thur    1   0   1   0
Lunch  Fri     1   6   1   6
       Thur   44  17  44  17

## CrossTabでクロス集計する

In [78]:
tips.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

### Smokerのクロス集計

In [79]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244

# Chap11